{"id":1324,"createdAt":"2025-11-23T16:24:28.582Z","updatedAt":"2025-11-23T16:29:43.546Z","displayColor":"#574cfa","published":true,"publishedAt":"2025-11-23T16:29:42.000Z","publishedWhere":"ResearchEquals","originMetadata":"ResearchEquals","url":"https://doi.org/10.53962/hw5w-5xyj","isbn":null,"prefix":"10.53962","suffix":"hw5w-5xyj","title":"Alexander Ohnemus Non-Profit Board Resume","description":"Alexander Ohnemus Non-Profit Board Resume Alexander Ohnemus Elk Grove, CA | (19164301568) | ohnemusalexander@email.com | LinkedIn: https://www.linkedin.com/in/minister-alexander-ohnemus-advanced-dip-dip-cert-cm-etc-92a6aa253?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app | ResearchGate: https://www.researchgate.net/profile/Minister-Alexander-Ohnemus  Professional Summary Dedicated interdisciplinary researcher and founder with a passion for inclusive education, advocacy for individuals with disabilities, and ethical innovation. Seeking volunteer opportunities on non-profit boards to contribute expertise in governance, strategic planning, and community partnerships. Proven track record in launching educational initiatives, fostering collaborations, and promoting equity through research in sociology, quantum mechanics, and anti-racism. Committed to supporting non-profits focused on disability rights, education accessibility, and restorative justice. Education Honorary PhD in Temporal Consequence Modification, Quantum Temporal Institute, 2025  Advanced Studies in Sociology, Quantum Mechanics, and Ethical Engineering (Self-Directed via ResearchGate Publications), Ongoing  Professional Experience Founder and Director, Quantum Temporal Institute (QTI) Elk Grove, CA | June 2025 – Present Established an online educational platform awarding Advanced Doctoral Diplomas (AdDs) exclusively to individuals with disabilities, emphasizing AI-assisted essay writing and evaluation for accessibility.  Led efforts to transition QTI from for-profit to non-profit status, including seeking partnerships with established organizations like Best Buddies and Project SEARCH to form advisory boards and ensure sustainable operations.  Managed accreditation processes with partners such as Best Buddies Project SEARCH in Sacramento and partial accreditation from the CPD Group, enhancing credibility and outreach.  Oversaw the creation of business plans and resources to expand QTI’s mission into English-speaking countries, focusing on equity and inclusion.  Intern, Best Buddies Project SEARCH UC Davis Sacramento Campus | Dates of Internship Collaborated on vocational training programs for individuals with disabilities, gaining hands-on experience in program coordination, mentorship, and community engagement.  Applied skills in networking and strategic outreach to support program goals, including potential collaborations for educational initiatives.  Independent Researcher ResearchGate | 2020 – Present Authored 673 publications with over 203,943 reads, covering topics in sociology, anti-racism, quantum temporal physics, and ethical genetic engineering.  Developed frameworks for voluntary interventions aimed at disease resistance and restorative justice, demonstrating analytical and innovative problem-solving abilities suitable for board-level decision-making.  Volunteer Experience and Community Involvement Advocate for Disability Rights and Education Accessibility: Actively sought partnerships with non-profits to enhance opportunities for underserved communities, including outreach to organizations like AbilityPath and The Arc.  Contributor to Academic and Ethical Discussions: Participated in online forums and publications promoting inclusive practices and restorative justice models.  Skills Governance & Board Leadership: Strategic planning, partnership development, and non-profit transition expertise.  Advocacy & Inclusion: Strong focus on disability rights, equity, and ethical frameworks.  Research & Analysis: Interdisciplinary knowledge in sociology, physics, and bioethics; proficient in AI tools for educational evaluation.  Communication: Effective in drafting proposals, letters, and essays; experienced in public outreach via social media and publications.  Collaboration: Skilled in networking with academic institutions, non-profits, and community programs.  Selected Publications & Achievements “Business Plan: Quantum Temporal Institute” (ResearchGate, 2025). https://www.researchgate.net/publication/395238734_Business_Plan_Quantum_Temporal_Institute .   “Peer Review of “Transhumanism > Eugenics Theorem” AND Sequel: Formalizing and Proving the Transhumanism > Eugenics Theorem” (ResearchGate, 2025). https://www.researchgate.net/publication/393781260_Peer_Review_of_Transhumanism_Eugenics_Theorem_AND_Sequel_Formalizing_and_Proving_the_Transhumanism_Eugenics_Theorem .   “Santa Claus as an Agent of Restorative Justice: A Proposal for Symbolic Reparation Beyond Statutes of Limitations” (ResearchGate, 2025). https://www.researchgate.net/publication/395353770_Santa_Claus_as_an_Agent_of_Restorative_Justice_A_Proposal_for_Symbolic_Reparation_Beyond_Statutes_of_Limitations .   Recognized for innovative approaches to accessible education, with ongoing efforts to amplify impact through non-profit collaborations.  References available upon request.","language":"en","licenseId":1,"moduleTypeId":5,"main":{"name":"alexander-ohnemus-non-profit-board-resume 2.pdf","size":99014,"uuid":"2d939be6-3066-4f4e-bc7f-e13ce7fb4cd0","cdnUrl":"https://ucarecdn.com/2d939be6-3066-4f4e-bc7f-e13ce7fb4cd0/","isImage":false,"isStored":true,"metadata":{},"mimeType":"application/pdf","sourceInfo":{"file":{},"source":"local"},"originalUrl":"https://ucarecdn.com/2d939be6-3066-4f4e-bc7f-e13ce7fb4cd0/","cdnUrlModifiers":null,"originalImageInfo":null,"originalVideoInfo":null,"originalContentInfo":{"mime":{"mime":"application/pdf","type":"application","subtype":"pdf"}}},"supporting":{"files":[]},"authorsRaw":{},"referencesRaw":{},"references":[],"authors":[{"id":1045,"createdAt":"2025-11-23T16:24:28.582Z","updatedAt":"2025-11-23T16:29:32.580Z","moduleId":1324,"workspaceId":743,"acceptedInvitation":true,"readyToPublish":false,"authorshipRank":0,"workspace":{"id":743,"createdAt":"2025-11-23T05:32:27.138Z","updatedAt":"2025-11-23T17:07:38.432Z","workspaceType":"Individual","handle":"crcguy","avatar":"https://eu.ui-avatars.com/api/?rounded=true&background=574cfa&color=ffffff&name=CRCguy","firstName":"Alexander","lastName":"Ohnemus","name":null,"bio":null,"pronouns":"He/him","url":"https://www.researchgate.net/profile/Minister-Alexander-Ohnemus","orcid":null}}],"license":{"id":1,"createdAt":"2022-01-31T18:58:51.475Z","source":"ResearchEquals","url":"https://creativecommons.org/publicdomain/zero/1.0/legalcode","name":"CC0 Public Domain Dedication","price":0,"price_id":null,"prod_id":"prod_M0VJdtMgxTMRvS"},"type":{"id":5,"createdAt":"2022-01-31T18:58:51.460Z","originType":"ResearchEquals","wikidata":"Q321703","name":"Premise","schema":"CreativeWork"},"parents":[],"children":[]}