{"id":1127,"createdAt":"2025-04-17T09:12:07.001Z","updatedAt":"2025-04-17T09:16:37.992Z","displayColor":"#db2777","published":true,"publishedAt":"2025-04-17T09:16:37.000Z","publishedWhere":"ResearchEquals","originMetadata":"ResearchEquals","url":"https://doi.org/10.53962/jkga-739m","isbn":null,"prefix":"10.53962","suffix":"jkga-739m","title":"Advocate with Impact: Building Confidence and Mastering Negotiation in Open Science","description":"Success in academia and open science is not just about groundbreaking research—it’s about advocating for your work, negotiating effectively, and communicating with confidence.\n\nYet, many Ph.D.s and open science researchers struggle with self-doubt, imposter syndrome, or hesitancy to assert their ideas, especially in competitive or collaborative settings.\n\nThis workshop, led by executive coach Jamie Lee, equips researchers with the tools to confidently advocate for themselves, their ideas, and their contributions.\n\nDrawing on evidence-based practical neuroscience and proven negotiation strategies, participants will learn to overcome the internal and external barriers that hinder self-advocacy.\n\nWhether negotiating resources, pitching a project, or navigating interdisciplinary collaborations, this session will empower attendees to show up as credible and impactful leaders.\n\nThrough interactive exercises and real-world examples tailored to the open science community, participants will:\n\nReframe unhelpful thought patterns and shift from self-doubt to self-assurance in minutes.\nLearn the fundamentals of negotiating effectively while preserving relationships.\nDevelop practical self-advocacy strategies for meetings, presentations, and collaborations.\nBuild confidence to navigate conflict and communicate with authority in challenging conversations.\nCreate a personalized toolkit for asserting their value and ensuring their voice is heard.\nJamie Lee, an executive coach specializing in self-advocacy and leadership, has helped professionals in high-stakes environments amplify their voices, lead with clarity, and achieve career-defining results. Her approach combines actionable tools with an understanding of the pressures unique to academia and research, empowering attendees to thrive in their roles","language":"en","licenseId":2,"moduleTypeId":21,"main":{"name":"Advocate with Impact Building Confidence and Mastering Negotiation in Open Science.pdf","size":56593843,"uuid":"4bfe854c-deca-41dd-a2b7-ff1ea54f458b","cdnUrl":"https://ucarecdn.com/4bfe854c-deca-41dd-a2b7-ff1ea54f458b/","isImage":false,"isStored":true,"metadata":{},"mimeType":"application/pdf","sourceInfo":{"file":{},"source":"local"},"originalUrl":"https://ucarecdn.com/4bfe854c-deca-41dd-a2b7-ff1ea54f458b/","cdnUrlModifiers":null,"originalImageInfo":null,"originalVideoInfo":null,"originalContentInfo":{"mime":{"mime":"application/pdf","type":"application","subtype":"pdf"}}},"supporting":{"files":[]},"authorsRaw":{},"referencesRaw":{},"references":[],"authors":[{"id":892,"createdAt":"2025-04-17T09:12:07.001Z","updatedAt":"2025-04-17T09:12:34.608Z","moduleId":1127,"workspaceId":650,"acceptedInvitation":true,"readyToPublish":false,"authorshipRank":0,"workspace":{"id":650,"createdAt":"2025-04-17T08:35:06.717Z","updatedAt":"2025-04-17T09:15:06.279Z","workspaceType":"Individual","handle":"jamieleecoach","avatar":"https://eu.ui-avatars.com/api/?rounded=true&background=574cfa&color=ffffff&name=jamieleecoach","firstName":"Jamie","lastName":"Lee","name":null,"bio":"Jamie Lee is a certified executive coach who helps smart folks who hate office politics get promoted and better paid without throwing anyone under the bus. \n\n\nFocusing on folks who identify or are socialized as women and people of color, she blends the best of proven negotiation strategies with evidence-based neuroplasticity tools so her clients lead and advocate with confidence and ease. \n\n\nA South Korean immigrant, Jamie first learned the value of self-advocacy from her mother, who single-handedly raised three daughters while running a nail salon and speaking broken English in New Jersey. \n\n\nBefore becoming a coach, Jamie negotiated as a buyer for multinational companies, worked as a hedge fund analyst, and later as operations director at NYC-based tech startups.\n\n\nOver a decade, Jamie has trained thousands of professionals in effective self-advocacy and workplace negotiation at leading organizations, including Citi, Unilever, Association of Corporate Counsels, American College of Cardiologists, UC Berkeley School of Business, and Smith College. \n","pronouns":"she/her","url":"https://jamieleecoach.com","orcid":null}}],"license":{"id":2,"createdAt":"2022-01-31T18:58:51.475Z","source":"ResearchEquals","url":"https://creativecommons.org/licenses/by/4.0/legalcode","name":"CC BY 4.0","price":0,"price_id":null,"prod_id":"prod_M0VKT0n4i9hFlz"},"type":{"id":21,"createdAt":"2022-01-31T18:58:51.460Z","originType":"ResearchEquals","wikidata":"Q604733","name":"Presentation","schema":"CreativeWork"},"parents":[],"children":[]}