{"id":666,"createdAt":"2023-03-26T19:58:17.692Z","updatedAt":"2023-03-26T21:57:53.599Z","displayColor":"#16a34a","published":true,"publishedAt":"2023-03-26T21:57:52.000Z","publishedWhere":"ResearchEquals","originMetadata":"ResearchEquals","url":"https://doi.org/10.53962/zrtc-b4dw","isbn":null,"prefix":"10.53962","suffix":"zrtc-b4dw","title":"Metadata Causal Inference of Concept Drifts in Probabilistic-Relational Machine Learning:  Predictive Analytics Using Graph Theory Methods in Cyber-Defense","description":"This research describes a novel approach to implementing cyber-defense protocols using supervised statistical-relational machine learning and lifted-inference in neural network architectures to detect concept drift anomalies. Data concept drift, or alternatively, concept shift, is a common yet difficult abnormality to detect in most data. Particularly metadata from adversarial cyber-attacks data originating from non-stationary environments, as detailed in the introduction. The Material and Methods and the Related Works sections describe the manuscript’s foundation in statistical-relational machine learning, otherwise known as relational machine learning, and its intrinsic suitability for identifying variables that may contain attributes, objects, entities and the like which contribute to concept drift irregularities during Exploratory Data Analysis (EDA) or Graphical Data Analysis (GDA) in detection of Structured Query Language Injection Attacks (SQLIA) probability. Moreover, balancing the tradeoffs when developing, Directed Acyclic Graphs (DAGs), Bayesian Networks (Bnets) and other network illustrations, demand increased computational time complexity. Lifted inference and prior probabilities are then introduced by the reproducible Analytics Solutions Unified Method for Data Mining/Predictive Analytics (ASUM-DM) framework, where handcrafting is efficacious and useful.  The use of ASUM-DM also increases probable concept drift anomaly detection; predictive cyber defensive applications in chaotic systems and projected prior dependencies from lifted inference for datatypes originating from non-stationary environments.  In later portions of this research, we describe how this approach allows for more efficient neural network design while enabling more consistent predictive analytics methods, enhancing proactive cyber-defense capabilities using modified activation functions amenable to a range of neural network architectures as a reflection of the Bayesian Information Criterion’s (BIC) output. This preemptive observation of the BIC value during epochs of neural networks identifies potential computational intractability and significantly reduces energy expenditure. We finalize hypothesis testing, neural network parameterization, and fine-tuning and develop a comprehensive evaluation and description of the findings, conclusion, and recommended areas of future research.  ","language":"en","licenseId":2,"moduleTypeId":6,"main":{"name":"Metadata Concept Shifts in Relational Machine Learning_03.26.23.docx","size":2395799,"uuid":"785f6e94-2e1d-4cbf-a2b0-3f0998617f89","cdnUrl":"https://ucarecdn.com/785f6e94-2e1d-4cbf-a2b0-3f0998617f89/","isImage":false,"isStored":true,"metadata":{},"mimeType":"application/vnd.openxmlformats-officedocument.wordprocessingml.document","sourceInfo":{"file":{},"source":"local"},"originalUrl":"https://ucarecdn.com/785f6e94-2e1d-4cbf-a2b0-3f0998617f89/","cdnUrlModifiers":null,"originalImageInfo":null,"originalVideoInfo":null,"originalContentInfo":{"mime":{"mime":"application/vnd.openxmlformats-officedocument.wordprocessingml.document","type":"application","subtype":"vnd.openxmlformats-officedocument.wordprocessingml.document"}}},"supporting":{"files":[]},"authorsRaw":{},"referencesRaw":{},"references":[],"authors":[{"id":498,"createdAt":"2023-03-26T19:58:17.692Z","updatedAt":"2023-03-26T21:56:37.554Z","moduleId":666,"workspaceId":359,"acceptedInvitation":true,"readyToPublish":false,"authorshipRank":0,"workspace":{"id":359,"createdAt":"2023-03-26T16:49:04.736Z","updatedAt":"2023-03-26T21:21:56.300Z","workspaceType":"Individual","handle":"aj_perri","avatar":"https://eu.ui-avatars.com/api/?rounded=true&background=574cfa&color=ffffff&name=aj_perri","firstName":"Karriem","lastName":"Perry","name":null,"bio":"Research scientist in the areas of relational-machine learning, quantum machine learning, quantum Bayesianism, relational quantum mechanics.","pronouns":"he/him","url":"https://github.com/AJ-Perry","orcid":"0000-0002-9992-6027"}}],"license":{"id":2,"createdAt":"2022-01-31T18:58:51.475Z","source":"ResearchEquals","url":"https://creativecommons.org/licenses/by/4.0/legalcode","name":"CC BY 4.0","price":0,"price_id":null,"prod_id":"prod_M0VKT0n4i9hFlz"},"type":{"id":6,"createdAt":"2022-01-31T18:58:51.460Z","originType":"ResearchEquals","wikidata":"Q41719","name":"Hypothesis","schema":"CreativeWork"},"parents":[],"children":[]}